In [1]:
import numpy as np
import pandas as pd

In [2]:
serie = pd.Series([5,6,7])
serie

0    5
1    6
2    7
dtype: int64

In [4]:
serie = pd.Series(np.arange(5, 9))
serie

0    5
1    6
2    7
3    8
dtype: int32

In [6]:
serie = pd.Series(np.array([8,9,10]))
serie

0     8
1     9
2    10
dtype: int32

In [7]:
serie = pd.Series({'a': 8, 'b': 12})
serie

a     8
b    12
dtype: int64

In [10]:
serie = pd.Series(range(2,6), index = ["hola", "perro", "gato", "mesa"])
serie

hola     2
perro    3
gato     4
mesa     5
dtype: int64

In [15]:
pd.Series(dtype = np.float64)

Series([], dtype: float64)

In [16]:
df = pd.DataFrame()
df['a'] = [5,6,7]
df['b'] = ["hola", "sí", "no"]
df

   a     b
0  5  hola
1  6    sí
2  7    no

In [17]:
df = pd.DataFrame({'a': [5,6,7],
                  'b': ["hola", "sí", "no"]})
df

   a     b
0  5  hola
1  6    sí
2  7    no

In [18]:
df['c'] = pd.Series([11,12,13])
df

   a     b   c
0  5  hola  11
1  6    sí  12
2  7    no  13

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [21]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [24]:
df.c

0    11
1    12
2    13
Name: c, dtype: int64

In [40]:
df.index = [9,8,4]
df

   a     b   c
9  5  hola  11
8  6    sí  12
4  7    no  13

In [41]:
df.index

Int64Index([9, 8, 4], dtype='int64')

In [44]:
df.loc[9,'a']

5

In [45]:
df.at[9,'a']

5

In [54]:
df.loc[9:4:2, ['a', 'b']]

   a     b
9  5  hola
4  7    no

In [55]:
df.loc[9:4:2, [True, True, False]]

   a     b
9  5  hola
4  7    no

In [64]:
mask = ('a' == df.columns) |  ('b' == df.columns)
mask

array([ True,  True, False])

In [66]:
df.loc[9:4:2, mask]

   a     b
9  5  hola
4  7    no

In [74]:
#df.loc[9, ['a', 'b']].append(df.loc[4, ['a', 'b']])
df.loc[df['a'] > 5, ['a', 'b']]

   a   b
8  6  sí
4  7  no

In [76]:
df.loc[8, 'c'] = np.NaN
df

   a     b     c
9  5  hola  11.0
8  6    sí   NaN
4  7    no  13.0

In [79]:
df.isnull()

       a      b      c
9  False  False  False
8  False  False   True
4  False  False  False

In [84]:
df.a.iloc[0::2]

9    5
4    7
Name: a, dtype: int64

In [87]:
df.iloc[::2, ::2]

   a     c
9  5  11.0
4  7  13.0

In [104]:
#df.loc[filas,columnas]
#df.iloc[filas, columnas]
df.loc[:,'a']
#df.a

9    5
8    6
4    7
Name: a, dtype: int64

In [105]:
df.iat[0,0]

5

In [108]:
valor_retornado = df.dropna()
valor_retornado
# opción 1
# df = df.dropna()
# opción 2
# df.dropna(inplace=True)

   a     b     c
9  5  hola  11.0
4  7    no  13.0

In [107]:
df

   a     b     c
9  5  hola  11.0
8  6    sí   NaN
4  7    no  13.0

In [109]:
df.dropna(axis=1)

   a     b
9  5  hola
8  6    sí
4  7    no

In [111]:
df.dropna(thresh = 3)

   a     b     c
9  5  hola  11.0
4  7    no  13.0

In [112]:
df.fillna(99)

   a     b     c
9  5  hola  11.0
8  6    sí  99.0
4  7    no  13.0

In [113]:
df

   a     b     c
9  5  hola  11.0
8  6    sí   NaN
4  7    no  13.0

In [117]:
valor_retornado = df.reset_index(drop = True)
df

   a     b     c
9  5  hola  11.0
8  6    sí   NaN
4  7    no  13.0

In [125]:
df.mean(axis=1)

C:\Users\Admin\AppData\Local\Temp/ipykernel_63448/3676274908.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=1)

9     8.0
8     6.0
4    10.0
dtype: float64

In [127]:
df['d'] = [8,6,9]
df.loc[:,['a', 'd']].mean(axis=1)

9    6.5
8    6.0
4    8.0
dtype: float64

In [130]:
df = pd.read_csv('http://winterolympicsmedals.com/medals.csv')
df.tail(3)

,Year,City,Sport,Discipline,NOC,Event,Event gender,Medal
2308,2006,Turin,Skiing,Snowboard,USA,Half-pipe,W,Silver
2309,2006,Turin,Skiing,Snowboard,USA,Snowboard Cross,M,Gold
2310,2006,Turin,Skiing,Snowboard,USA,Snowboard Cross,W,Silver